stress-test/jmeter/plan/requests/listschemas.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:cat="http://oss.dbc.dk/ns/catalogingUpdate">
	<soapenv:Header />
	<soapenv:Body>
		<cat:getSchemas>
			<cat:getSchemasRequest>
                <cat:authentication>
                    <cat:groupIdAut>714700</cat:groupIdAut>
                    <cat:passwordAut>20Koster</cat:passwordAut>
                    <cat:userIdAut>netpunkt</cat:userIdAut>
                </cat:authentication>

				<cat:trackingId>JMeter_ListSchemas</cat:trackingId>
			</cat:getSchemasRequest>
		</cat:getSchemas>
	</soapenv:Body>
</soapenv:Envelope>
