updateservice-ws/src/wsdl/update/soap_getSchemas.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cat="http://oss.dbc.dk/ns/catalogingUpdate">
   <soapenv:Header/>
   <soapenv:Body>
      <cat:getSchemas>
         <cat:getSchemasRequest>
            <!--Optional:-->
            <cat:authentication>
               <cat:groupIdAut>?</cat:groupIdAut>
               <cat:passwordAut>?</cat:passwordAut>
               <cat:userIdAut>?</cat:userIdAut>
            </cat:authentication>
            <cat:agencyId>?</cat:agencyId>
            <!--Optional:-->
            <cat:trackingId>?</cat:trackingId>
         </cat:getSchemasRequest>
      </cat:getSchemas>
   </soapenv:Body>
</soapenv:Envelope>
